In [13]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [24, 27, 22, 32, 29],
    'score': [85, 88, 92, 75, 95]
}
df = pd.DataFrame(data)

In [3]:
# What is the average score of the people in the DataFrame?
df['score'].mean()

np.float64(87.0)

In [5]:
# How would you filter this DataFrame to only include rows where
#  the age is greater than or equal to 30?
df[df['age']>=30]

    name  age  score
3  David   32     75

In [7]:
# How would you sort this DataFrame by score in descending order?
df.sort_values('score',ascending=False)

      name  age  score
4      Eva   29     95
2  Charlie   22     92
1      Bob   27     88
0    Alice   24     85
3    David   32     75

In [11]:
# How would you add a new column passed that indicates whether the person has passed (score >= 80)?
df['passed']=df['score']>=80
print(df)

df['passed'] = df['score'].apply(lambda x: 'passed' if x >= 80 else 'failed')
print(df)

      name  age  score  passed
0    Alice   24     85    True
1      Bob   27     88    True
2  Charlie   22     92    True
3    David   32     75   False
4      Eva   29     95    True
      name  age  score  passed
0    Alice   24     85  passed
1      Bob   27     88  passed
2  Charlie   22     92  passed
3    David   32     75  failed
4      Eva   29     95  passed

In [14]:
df['passed'] = np.where(df['score'] >= 80, 'passed', 'failed')
print(df)

      name  age  score  passed
0    Alice   24     85  passed
1      Bob   27     88  passed
2  Charlie   22     92  passed
3    David   32     75  failed
4      Eva   29     95  passed

In [15]:
# How would you calculate the sum of the age column?
df['age'].sum()

np.int64(134)

In [34]:
df

      name  age  score
0    Alice   24     85
1      Bob   27     90
2  Charlie   22     92
3    David   32     75
4      Eva   29     95

In [33]:
# How would you change the score of 'Bob' to 90?
df.loc[df['name']=='Bob','score']=90

In [36]:
# How would you rename the column score to marks?
df.rename(columns={'score':'marks'})

      name  age  marks
0    Alice   24     85
1      Bob   27     90
2  Charlie   22     92
3    David   32     75
4      Eva   29     95

In [44]:
df.isna().sum()

name     0
age      0
score    0
dtype: int64

In [41]:
df.isna().any().any()

np.False_

In [29]:
df.columns

Index(['name', 'age', 'score'], dtype='object')

In [28]:
df.drop(columns=[ False],inplace=True)